tests/solver_wrappers/openfoam/test_v41/tube3d/setup_openfoam/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application directory
application=`getApplication`

runApplication blockMesh 1> /dev/null


#------------------------------------------------------------------------------
