tests/solver_wrappers/openfoam/test_v41/tube3d/setup_openfoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-12;
        relTol           1e-9;

        smoother         DICGaussSeidel;

    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-12;
        relTol          1e-9;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }

    "cellDisplacement"
    {
    	solver          GAMG;
    	smoother        GaussSeidel;
    	tolerance       1e-12;
    	relTol          1e-9;
    }
}

PIMPLE
{
    nOuterCorrectors 100;
    momentumPredictor no;
    nNonOrthogonalCorrectors 0;
    nCorrectors         3;
    residualControl
    {
        p
        {
             tolerance   1e-10;
             relTol      0;
        }
        U
        {
             tolerance   1e-10;
             relTol      0;
        }
    }
}


// ************************************************************************* //
